back-end/ruby-on-rails/app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
    @entries = Entry.all

INSERT INTO "entries" ("meal_type", "calories", "proteins", "cabohydrates", "fats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["meal_type", "Breakfast"], ["calories", 10], ["proteins", 10], ["cabohydrates", 10], ["fats", 10], ["created_at", "2021-03-17 13:32:26.408214"], ["updated_at", "2021-03-17 13:32:26.408214"]]
---
  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_entry
      @entry = Entry.find(params[:id])